{
    "title": "سياسة الخصوصية",
    "lastUpdated": "آخر تحديث: 1 مارس 2025",
    "sections": {
      "introduction": {
        "title": "مقدمة",
        "content": [
          "نحن في شركة مثال نحترم خصوصيتك وملتزمون بحماية بياناتك الشخصية. ستخبرك سياسة الخصوصية هذه عن كيفية رعايتنا لبياناتك الشخصية عند زيارة موقعنا الإلكتروني، وعن حقوق الخصوصية الخاصة بك وكيف يحميك القانون.",
          "تنطبق سياسة الخصوصية هذه على جميع المعلومات التي يتم جمعها من خلال موقعنا الإلكتروني وتطبيقاتنا المحمولة و/أو أي خدمات أو مبيعات أو تسويق أو أحداث مرتبطة (مجتمعة، \"الخدمات\")."
        ]
      },
      "informationCollected": {
        "title": "المعلومات التي نجمعها",
        "intro": "نجمع عدة أنواع من المعلومات من مستخدمي خدماتنا، بما في ذلك:",
        "items": [
          {
            "title": "المعرفات الشخصية",
            "content": "الاسم، عنوان البريد الإلكتروني، العنوان البريدي، رقم الهاتف، ومعرفات مماثلة أخرى."
          },
          {
            "title": "معلومات الحساب",
            "content": "اسم المستخدم، كلمة المرور، تفضيلات الحساب، وسجل المشتريات."
          },
          {
            "title": "معلومات الدفع",
            "content": "أرقام البطاقات الائتمانية، معلومات البنك، والعناوين الخاصة بالفوترة."
          },
          {
            "title": "بيانات الاستخدام",
            "content": "معلومات حول كيفية استخدامك لموقعنا الإلكتروني ومنتجاتنا وخدماتنا."
          },
          {
            "title": "بيانات تقنية",
            "content": "عنوان IP، نوع المتصفح، نظام التشغيل، معلومات الجهاز، ومعرفات تقنية أخرى على الأجهزة التي تستخدمها للوصول إلى خدماتنا."
          }
        ]
      },
      "informationUse": {
        "title": "كيف نستخدم معلوماتك",
        "intro": "نستخدم المعلومات التي نجمعها عنك لأغراض مختلفة، بما في ذلك:",
        "items": [
          "تقديم الخدمات والحفاظ عليها وتحسينها.",
          "معالجة طلباتك وإرسال المعلومات المتعلقة بها، بما في ذلك تأكيدات الطلب والفواتير.",
          "إرسال المعلومات الإدارية، مثل التحديثات على الشروط والبنود والسياسات.",
          "تخصيص تجربتك وتقديم محتوى وعروض منتجات ذات صلة باهتماماتك.",
          "الرد على تعليقاتك وأسئلتك وطلباتك وتقديم خدمة العملاء.",
          "الحماية والتحقيق وردع الأنشطة الاحتيالية أو غير المصرح بها أو غير القانونية."
        ]
      },
      "dataSharing": {
        "title": "مشاركة البيانات والإفصاح",
        "intro": "قد نشارك معلوماتك الشخصية مع:",
        "items": [
          {
            "title": "مقدمي الخدمات",
            "content": "قد نشارك معلوماتك مع بائعين وموفري خدمات ومقاولين ووكلاء من جهات خارجية يؤدون خدمات لنا."
          },
          {
            "title": "التحويلات التجارية",
            "content": "إذا شاركنا في اندماج أو استحواذ أو بيع كل أو جزء من أصولنا، قد يتم نقل معلوماتك كجزء من تلك الصفقة."
          },
          {
            "title": "الامتثال للقوانين",
            "content": "قد نكشف عن معلوماتك عندما نكون ملزمين قانونيًا بذلك."
          },
          {
            "title": "بموافقتك",
            "content": "قد نشارك معلوماتك مع أطراف ثالثة عندما تعطينا موافقتك على ذلك."
          }
        ]
      },
      "yourRights": {
        "title": "حقوقك",
        "intro": "اعتمادًا على موقعك، قد يكون لديك حقوق معينة تتعلق بمعلوماتك الشخصية، بما في ذلك:",
        "items": [
          "الحق في الوصول إلى معلوماتك الشخصية والحصول على نسخة منها.",
          "الحق في طلب تصحيح معلوماتك الشخصية.",
          "الحق في طلب محو معلوماتك الشخصية.",
          "الحق في تقييد معالجة معلوماتك الشخصية.",
          "الحق في نقل البيانات.",
          "الحق في الاعتراض على معالجة معلوماتك الشخصية."
        ],
        "contact": "لممارسة أي من هذه الحقوق، يرجى الاتصال بنا على {{email}}"
      },
      "contact": {
        "title": "اتصل بنا",
        "content": "إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه أو ممارسات الخصوصية لدينا، يرجى الاتصال بنا على: {{email}}"
      }
    }
  }