{
  "title": "شروط الخدمة",
  "lastUpdated": "آخر تحديث: 1 مارس 2025",
  "sections": {
    "introduction": {
      "title": "1. المقدمة",
      "content": [
        "مرحبًا بك في منصتنا. تحكم شروط الخدمة هذه (\"الشروط\") وصولك إلى موقعنا الإلكتروني ومنتجاتنا وخدماتنا واستخدامها. باستخدامك لخدماتنا، فإنك توافق على الالتزام بهذه الشروط وسياسة الخصوصية الخاصة بنا.",
        "يرجى قراءة هذه الشروط بعناية قبل استخدام خدماتنا. إذا كنت لا توافق على هذه الشروط، يجب عليك عدم الوصول إلى خدماتنا أو استخدامها."
      ]
    },
    "definitions": {
      "title": "2. التعاريف",
      "content": {
        "service": "\"الخدمة\" تشير إلى الموقع الإلكتروني والتطبيق والخدمات المقدمة من قبل شركتنا.",
        "user": "\"المستخدم\" يشير إلى الأفراد الذين يصلون إلى خدمتنا أو يستخدمونها.",
        "content": "\"المحتوى\" يشير إلى النصوص أو الرسومات أو الصور أو الموسيقى أو البرمجيات أو الصوت أو الفيديو أو المعلومات أو أي مواد أخرى."
      }
    },
    "userAccounts": {
      "title": "3. حسابات المستخدمين",
      "content": [
        "3.1. للوصول إلى بعض ميزات الخدمة، قد يُطلب منك إنشاء حساب. توافق على تقديم معلومات دقيقة وحديثة وكاملة أثناء عملية التسجيل.",
        "3.2. أنت مسؤول عن الحفاظ على سرية كلمة المرور الخاصة بك وعن جميع الأنشطة التي تحدث ضمن حسابك. توافق على إخطارنا فورًا بأي استخدام غير مصرح به لحسابك.",
        "3.3. نحتفظ بالحق في تعليق أو إنهاء حسابك إذا كانت أي معلومات مقدمة أثناء التسجيل أو بعده غير دقيقة أو غير حديثة أو غير كاملة."
      ]
    },
    "ordering": {
      "title": "4. الطلب والدفع",
      "content": [
        "4.1. عند تقديم طلب عبر خدمتنا، فإنك تقدم عرضًا لشراء المنتجات أو الخدمات الموضحة في طلبك.",
        "4.2. نحتفظ بالحق في رفض أو إلغاء أي طلبات وفقًا لتقديرنا الخاص. إذا قمنا بإلغاء طلب بعد أن تم خصم المبلغ منك، سنعيد المبلغ المدفوع.",
        "4.3. يجب دفع المبلغ عند الطلب. نقبل عدة طرق دفع كما هو موضح في خدمتنا."
      ]
    },
    "ip": {
      "title": "5. حقوق الملكية الفكرية",
      "content": [
        "5.1. تظل الخدمة ومحتواها الأصلي وميزاتها ووظائفها ملكًا حصريًا لشركتنا ومرخصيها.",
        "5.2. لا يجوز استخدام علامتنا التجارية أو مظهرنا التجاري مع أي منتج أو خدمة دون موافقة كتابية مسبقة من شركتنا."
      ]
    },
    "userContent": {
      "title": "6. محتوى المستخدم",
      "content": [
        "6.1. قد تتيح لك خدمتنا نشر أو ربط أو تخزين أو مشاركة أو إتاحة بعض المعلومات أو النصوص أو الرسومات أو الفيديوهات أو المواد الأخرى. أنت مسؤول عن المحتوى الذي تنشره على الخدمة أو من خلالها.",
        "6.2. بنشرك للمحتوى على الخدمة أو من خلالها، تمنحنا الحق في استخدام وتعديل وعرض وأداء وإعادة إنتاج وتوزيع هذا المحتوى على الخدمة ومن خلالها."
      ]
    },
    "prohibited": {
      "title": "7. الاستخدامات المحظورة",
      "content": [
        "توافق على عدم استخدام الخدمة:",
        "7.1. بأي طريقة تنتهك أي قانون أو لائحة محلية أو دولية سارية.",
        "7.2. لإرسال أو التسبب في إرسال أي مواد إعلانية أو ترويجية، بما في ذلك \"البريد المزعج\" أو \"سلاسل الرسائل\" أو \"الرسائل غير المرغوب فيها\" أو أي طلبات مشابهة.",
        "7.3. لانتحال شخصية شركتنا أو أحد موظفيها أو مستخدم آخر أو أي شخص أو جهة أخرى."
      ]
    },
    "liability": {
      "title": "8. تحديد المسؤولية",
      "content": [
        "8.1. لا تتحمل شركتنا أو مدراؤها أو موظفوها أو شركاؤها أو وكلاؤها أو موردوها أو الشركات التابعة لها أي مسؤولية عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو عقابية، بما في ذلك على سبيل المثال لا الحصر، فقدان الأرباح أو البيانات أو الاستخدام أو السمعة أو أي خسائر غير ملموسة أخرى.",
        "8.2. مسؤوليتنا محدودة إلى أقصى حد يسمح به القانون."
      ]
    },
    "changes": {
      "title": "9. التغييرات على الشروط",
      "content": "نحتفظ بالحق في تعديل أو استبدال هذه الشروط في أي وقت وفقًا لتقديرنا الخاص. إذا كان هناك تغيير جوهري، سنقدم إشعارًا قبل 30 يومًا على الأقل من سريان الشروط الجديدة. سنحدد ما إذا كان التغيير جوهريًا وفقًا لتقديرنا الخاص."
    },
    "contact": {
      "title": "10. اتصل بنا",
      "content": "إذا كان لديك أي أسئلة حول هذه الشروط، يرجى التواصل معنا عبر البريد الإلكتروني contact@codemastersjo.site أو من خلال نموذج الاتصال الخاص بنا."
    }
  }
}
